EDT/УТ/src/Documents/АннулированиеЧеков/АннулированиеЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АннулированиеЧеков</name>
  <registerRecords>AccumulationRegister.ЖурналККМ</registerRecords>
  <attributes>
    <name>ПериодФормированияДанных</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатДоставки</name>
      <type>
        <types>CatalogRef.новаРезультатМестнойДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНевыполнения</name>
      <type>
        <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаАннулированияЧеков</name>
      <type>
        <types>EnumRef.ПричиныАннулированияЧеков</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекиКАннулированию</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Чек</name>
      <type>
        <types>DocumentRef.ЧекККМ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоДаннымЗаполнения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КАннулированию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПечатиЧеков</name>
      <type>
        <types>DocumentRef.ПечатьЧековПоДоставкам</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратныеЧеки</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Чек</name>
      <type>
        <types>DocumentRef.ЧекККМ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВозвратныйЧек</name>
      <type>
        <types>DocumentRef.ЧекККМ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/ЖурналККМ/ЖурналККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЖурналККМ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЧекККМ</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЧекККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Секция</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЧекПробитОшибочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Enums/ТипыКассовыхЧеков/ТипыКассовыхЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКассовыхЧеков</name>
  <enumValues>
    <name>ЧекПрихода</name>
  </enumValues>
  <enumValues>
    <name>ЧекВозвратаПрихода</name>
  </enumValues>
  <enumValues>
    <name>ЧекРасхода</name>
  </enumValues>
  <enumValues>
    <name>ЧекВозвратаРасхода</name>
  </enumValues>
  <enumValues>
    <name>ЧекКоррекцииПрихода</name>
  </enumValues>
  <enumValues>
    <name>ЧекКоррекцииВозвратаПрихода</name>
  </enumValues>
  <enumValues>
    <name>ЧекКоррецииРасхода</name>
  </enumValues>
  <enumValues>
    <name>ЧекКоррекцииВозвратаРасхода</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/АннулированиеЧеков/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	
	Движения.ЖурналККМ.Записывать = Истина;
	
	//ТЗЧекиКАннулированию = ЧекиКАннулированию.Выгрузить(,"Чек");
	//ТЗЧекиКАннулированию.Свернуть("Чек");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	АннулированиеЧековЧекиКАннулированию.Чек
	                      |ИЗ
	                      |	Документ.АннулированиеЧеков.ЧекиКАннулированию КАК АннулированиеЧековЧекиКАннулированию
	                      |ГДЕ
	                      |	АннулированиеЧековЧекиКАннулированию.Ссылка.Ссылка = &Ссылка
	                      |	И АннулированиеЧековЧекиКАннулированию.КАннулированию
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	АннулированиеЧековЧекиКАннулированию.Чек");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Рез = Запрос.Выполнить().Выгрузить();
	
	Для каждого ТекСтрокаЧеки Из Рез Цикл					
		Движение = Движения.ЖурналККМ.Добавить();
		Движение.Период = ТекСтрокаЧеки.Чек.Дата;
		Движение.КассаККМ = ТекСтрокаЧеки.Чек.КассаККМ;
		Движение.ВидОперации = ТекСтрокаЧеки.Чек.ВидОперации;
		Движение.Отдел = ТекСтрокаЧеки.Чек.Склад;
		Движение.Секция = ТекСтрокаЧеки.Чек.Секция;
		Движение.ЧекККМ = ТекСтрокаЧеки.Чек;
		Движение.ЧекПробитОшибочно = Истина;
		Движение.Сумма = ТекСтрокаЧеки.Чек.СуммаДокумента;
		Движение.ТипОплаты = ТекСтрокаЧеки.Чек.ТипОплаты;
		Движение.Кассир = ТекСтрокаЧеки.Чек.Ответственный;			
	КонецЦикла;	
	
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ Заказы.Количество() Тогда	
		Сообщить("Заказы не заполнены");	
	    Отказ = Истина;
	КонецЕсли;	
	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ВозвратныеЧеки.Количество() Тогда
		
		Сообщить("Перед проведением нужно заполнить возвратные заказы");
		Отказ = Истина;		
	
	КонецЕсли;
	
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Сообщить("Отмена проведения запрещена");
		Отказ = Истина;	
	
	КонецЕсли;
	
	//РубежФЗ54 = Константы.ДатаВремяПереходаНаФЗ54.Получить();
	//
	//// создаем возвратные чеки	
	//Для каждого Ст Из ЧекиКАннулированию Цикл	
	//	Если РубежФЗ54 < Ст.Чек.Дата Тогда
	//		ВозвратныйЧек = СоздатьВозвратныйЧек(Ст.Чек);	
	//		ДобЧек = ВозвратныеЧеки.Добавить();
	//		ДобЧек.ВозвратныйЧек = ВозвратныйЧек;
	//		ДобЧек.Заказ 		 = Ст.Заказ;
	//		ДобЧек.Чек   		 = Ст.Чек;
	//	КонецЕсли;
	//КонецЦикла;
			
КонецПроцедуры


Функция СоздатьВозвратныйЧек(Чек)
	
	ВозвратныйЧек = Чек.Скопировать();
	ВозвратныйЧек.ТипКассовогоЧека = Перечисления.ТипыКассовыхЧеков.ЧекВозвратаПрихода;
	ВозвратныйЧек.ЧекПробитНаККМ = Ложь;
	ВозвратныйЧек.НомерЧекаККМ = 0;
	ВозвратныйЧек.ЧекПробитОшибочно = Ложь;
	ВозвратныйЧек.НомерСменыККМ = 0;
	ВозвратныйЧек.Ответственный = Оператор;
	ВозвратныйЧек.Дата = Дата;
	
	ВозвратныйЧек.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат ВозвратныйЧек.Ссылка;
		

КонецФункции
